[
  {
    "body": "What do you call a cow with no legs?\r\n\r\nGround Beef!",
    "category": "Animal",
    "id": 1,
    "title": "Cow With No Legs"
  },
  {
    "body": "What do you call a cow jumping over a barbed wire fence?\r\n\r\nUtter destruction.",
    "category": "Animal",
    "id": 2,
    "title": "Jumping Cow"
  },
  {
    "body": "What's black and white and red all over?\r\n\r\nA newspaper.",
    "category": "Other / Misc",
    "id": 4,
    "title": "Black, White and Red"
  },
  {
    "body": "So, this guy walks into a bar.\r\n\r\nAnd says, \"ouch\".",
    "category": "Bar",
    "id": 5,
    "title": "Guy in a Bar"
  },
  {
    "body": "If the opposite of pro is con, isn't the opposite of progress, congress?",
    "category": "One Liners",
    "id": 6,
    "title": "Progress"
  },
  {
    "body": "What do you call a guy with no arms or legs floating in the ocean?\r\n\r\nBob!",
    "category": "Other / Misc",
    "id": 7,
    "title": "Guy with no Limbs"
  },
  {
    "body": "I went to a wedding the other day.  Two antennas were getting married.  It wasn't much of a wedding ceremony, but it was one heck of a reception!",
    "category": "Puns",
    "id": 8,
    "title": "Antenna"
  },
  {
    "body": "There's this dyslexic guy... he walked into a bra...",
    "category": "Bar",
    "id": 9,
    "title": "Into the Bar"
  },
  {
    "body": "Joel: \"How's the progress on new house that you are building Pete?\"\r\nPeter: \"Things are really slow at the moment.\"\r\nJoel: \"Yeah, I guess all this rain would be putting a dampener on things...\"",
    "category": "Puns",
    "id": 10,
    "title": "Rain"
  },
  {
    "body": "A white horse walked into a bar.  The barman saw him and said,  \"We have a whiskey named after you!\"\r\n\r\nThe horse looked puzzled and said, \"What, Eric?\"",
    "category": "Other / Misc",
    "id": 11,
    "title": "White Horse"
  },
  {
    "body": "There was a dyslexic insomniac agnostic.\r\n\r\nHe laid awake all night wondering if there really was a Dog.",
    "category": "One Liners",
    "id": 12,
    "title": "Pondering the afterlife"
  },
  {
    "body": "What do you call 500 lawyers at the bottom of the sea?\r\n\r\nA start.",
    "category": "Lawyer",
    "id": 13,
    "title": "500 Lawyers"
  },
  {
    "body": "What's the difference between a bad golfer and a bad skydiver?\r\n\r\nA bad golfer goes whack, dang. A bad skydiver goes dang, whack.",
    "category": "Sports",
    "id": 14,
    "title": "What's the difference?"
  },
  {
    "body": "Saddam Hussein was sitting in his office wondering who to invade next when his telephone rang. \r\n\r\n\"Hallo! Mr. Hussein,\" a heavily accented voice said. \"This is Paddy up in County Cavan, Ireland. I am ringing to inform you that we are officially declaring war on you!\" \r\n\r\n\"Well, Paddy,\" Saddam replied, \"this is indeed important news! Tell me, how big is your army?\" \r\n\r\n\"At this moment in time,\" said Paddy after a moment's calculation, \"there is myself, my cousin Sean, my next door neighbor Gerry, and the entire dominoes team from the pub-that makes 8!\" \r\n\r\nSaddam sighed. \"I must tell you Paddy that I have 1 million men in my army waiting to move on my command.\" \r\n\r\n\"Begorra!\" said Paddy, \"I'll have to ring you back!\" \r\n\r\nSure enough, the next day Paddy rang back. \"Right Mr. Hussein, the war is still on! We have managed to acquire some equipment!\" \r\n\r\n\"And what equipment would that be, Paddy?\" Saddam asked. \r\n\r\n\"Well, we have 2 combine harvesters, a bulldozer and Murphy's tractor from the farm.\" \r\n\r\nOnce more Saddam sighed. \"I must tell you, Paddy, that I have 16 thousand tanks, 14 thousand armored personnel carriers, and my army has increased to 1 and a half million since we last spoke.\" \r\n\r\n\"Really?\" said Paddy \"I'll have to ring you back!\" \r\n\r\nSure enough, Paddy rang again the next day. \"Right Mr. Hussein, the war is still on! We have managed to get ourselves airborne! We've modified Ted's ultralight with a couple of rifles in the cockpit and the bridge team has joined us as well!\" \r\n\r\nSaddam was silent for a minute, then sighed. \"I must tell you Paddy that I have a thousand bombers, 500 MiG 19 attack planes, my military complex is surrounded by laser-guided surface-to-air missile sites, and since we last spoke, my army has increased to 2 million.\" \r\n\r\n\"Faith and begorra!\" said Paddy, \"I'll have to ring you back.\" \r\n\r\nSure enough, Paddy called again the next day. \"Right Mr. Hussein, I am sorry to tell you that we have had to call off the war.\" \r\n\r\n\"I'm sorry to hear that,\" said Saddam. \"Why the sudden change of heart?\" \r\n\r\n\"Well,\" said Paddy \"We've all had a chat, and there's no way we can feed 2 million prisoners.\"",
    "category": "Other / Misc",
    "id": 15,
    "title": "Hello! Mr Hussein?"
  },
  {
    "body": "A little old lady goes to the doctor and says, \"Doctor I have this problem with wind, but it really doesn't bother me too much because they never smell and are always silent.\"\r\n\r\n\"As a matter of fact, I've farted at least 20 times since I've been here in your office.\" The doctor says, \"I see, take these pills and come back to see me next week.\" \r\n\r\nThe next week the lady goes back to his office. \"Doctor,\" she says, \"I don't know what you gave me, but now my farts, although still silent, stink terribly!\" \r\n\r\nThe doctor says, \"Good, Now that we've cleared up your sinuses, let's work on your hearing.\"",
    "category": "Medical",
    "id": 16,
    "title": "Windy"
  },
  {
    "body": "Do infants enjoy infancy as much as adults enjoy adultery?",
    "category": "One Liners",
    "id": 17,
    "title": "Infants vs Adults"
  },
  {
    "body": "If a pig loses its voice, is it disgruntled?",
    "category": "One Liners",
    "id": 18,
    "title": "Pig"
  },
  {
    "body": "Saddam Hussein and George W. Bush meet up in Baghdad for the first round of talks in a new peace process. When George sits down, he notices three buttons on the side of Saddam's chair.\r\n\r\nThey begin talking. After about five minutes, Saddam presses the first button. A boxing glove springs out of a box on the desk and punches Bush in the face.\r\n\r\nConfused, Bush carries on talking as Saddam laughs. A few minutes later, the second button is pressed. This time a big boot comes out and kicks Bush in the shin. Again Saddam laughs, and again Bush carries on talking, not wanting to put off the bigger issue of peace between the two countries.\r\n\r\nBut when the third button is pressed and another boot comes out and kicks Bush in the privates, he's finally had enough, knowing that he can't do much without them functioning well.\r\n\r\n\"I'm going back home!\" he tells the Iraqi. \"We'll finish these talks in two weeks!\"\r\n\r\nA fortnight passes and Saddam flies to the United States for talks. As the two men sit down, Hussein notices three buttons on Bush's chair and prepares himself for the Yank's revenge.\r\n\r\nThey begin talking and George presses the first button. Saddam ducks, but nothing happens. Bush snickers. A few seconds later he presses the second button. Saddam jumps up, but again nothing happens. Bush roars with laughter. When the third button is pressed, Saddam jumps up again, and again nothing happens. Bush falls on the floor in a fit of hysterics.\r\n\r\n\"Forget this,\" says Saddam. \"I'm going back to Baghdad!\" Bush says through tears of laughter, \"What Baghdad?\"",
    "category": "News / Politics",
    "id": 19,
    "title": "Buttons"
  },
  {
    "body": "During the wedding rehearsal, the groom approached the pastor with an unusual offer. \"Look, I'll give you $100 if you'll change the wedding vows. When you get to me and the part where I'm to promise to 'love, honour and obey' and 'forsaking all others, be faithful to her forever,' I'd appreciate it if you'd just leave that part out.\" He passed the minister a $100 bill and walked away satisfied.\r\nIt is now the day of the wedding, and the bride and groom have moved to that part of the ceremony where the vows are exchanged. When it comes time for the groom's vows, the pastor looks the young man in the eye and says:\r\n\"Will you promise to prostrate yourself before her, obey her every command and wish, serve her breakfast in bed every morning of your life and swear eternally before God and your lovely wife that you will not ever even look at another woman, as long as you both shall live?\"\r\nThe groom gulped and looked around, and said in a tiny voice, \"Yes.\"\r\nThe groom leaned toward the pastor and hissed, \"I thought we had a deal.\"\r\nThe pastor put the $100 bill into his hand and whispered back, \"She made me a much better offer.\"",
    "category": "Men / Women",
    "id": 20,
    "title": "Bride & Groom"
  },
  {
    "body": "Doctor: Well I hope you enjoy changing diapers, Mrs Jones?\r\nMrs Jones: Why, Am I pregnant?\r\nDoctor: No, you have bowel cancer!",
    "category": "Gross",
    "id": 21,
    "title": "Am I Pregnant?"
  },
  {
    "body": "What do you call a blond with half a brain?\r\n\r\nGifted.",
    "category": "Blond",
    "id": 22,
    "title": "Clever Blond"
  },
  {
    "body": "Q What has two legs, and bleeds?\r\n\r\nA Half a dog!",
    "category": "Gross",
    "id": 23,
    "title": "Two Legs"
  },
  {
    "body": "An Essex girl walks into the local dry cleaners. She places a garment on the counter.\r\n\r\n\"I'll be back tomorrow afternoon to pick up my dress,\" she says.\r\n\r\n\"Come again?\" says the clerk, cupping his ear.\r\n\r\n\"No\" she replies. \"This time it's mayonnaise.\"",
    "category": "Blond",
    "id": 24,
    "title": "Dry Cleaners"
  },
  {
    "body": "A drunk man walked up to an elevator. He pressed the up button and opened the doors before the elevator could come down to him. He fell all the way down, and said, \"Darn it, I said up.\"",
    "category": "Other / Misc",
    "id": 27,
    "title": "I Said Up"
  },
  {
    "body": "Yo momma is so stupid, she took the Pepsi challenge and chose Jif.",
    "category": "Yo Momma",
    "id": 28,
    "title": "Pepsi Challenge"
  },
  {
    "body": "You know you're a redneck if you introduce a friend to your wife and sister and he only has to shake one hand.",
    "category": "Redneck",
    "id": 29,
    "title": "How You Can Tell Your A Redneck.."
  },
  {
    "body": "A patient wakes up after having surgery to remove a gangrenous leg.\r\n\r\nDoctor:  \"I have good news and bad news.\"\r\nPatient:  \"What's the bad news?\"\r\nDoctor: \"The bad news is that we amputated the wrong leg.\"\r\nPatient: \"That's terrible!  What's the good news?\"\r\nDoctor: \"We think the other leg is going to make it alright.\"",
    "category": "Medical",
    "id": 30,
    "title": "Amputation"
  },
  {
    "body": "Yo momma is so fat, that to get her out of a phone booth we had to grease her thighs and throw a Twinkie into the street.",
    "category": "Yo Momma",
    "id": 31,
    "title": "Phone Booth"
  },
  {
    "body": "A man and his wife were cleaning out their attic when the man found a shoe repair stub in the pocket of an old jacket.  \"Hey - check this out,\"  he said to his wife, \"this stub is 20 years old.  I wonder if the shop still has the shoes.\"\r\nSo the next day the man went to the shoe shop and asked the owner if he still had the shoes.  The owner disappeared into the back of the shop for about five minutes.\r\nWhen he returned, he replied happily, \"Yup, believe it or not, we've still got the shoes.  They'll be ready next Thursday.\"",
    "category": "Other / Misc",
    "id": 32,
    "title": "Shoe Repair"
  },
  {
    "body": "A bishop, a priest, and a Rabbi walk into a bar.\r\n\r\nThe bartender looks at them and says, \"What is this, a joke?\"",
    "category": "Religious",
    "id": 33,
    "title": "Bishop, Priest, Rabbi"
  },
  {
    "body": "The Pope, a hippie, and George Bush were all on a plane that was crashing.  The pilots had already jumped to safety and there were only two parachutes left.  Without a moment's hesitation, Bush grabbed a pack, yelled \"I'm the most powerful man in the universe! I have to survive!\", and jumped from the plane.\r\nThe Pope, being the generous man that he is, said to the hippie, \"You go ahead and take the last parachute.  I'm an old man and I have lived a very full life.\"  \r\nThe hippie thanked the Pope but said, \"Don't worry - we'll both be fine.  The most powerful man in the universe just jumped off the plane with my backpack.\"",
    "category": "Other / Misc",
    "id": 34,
    "title": "Crashing Plane"
  },
  {
    "body": "Economic times were very bad, so the plant owner had a difficult time finding people to work in his new factory.  In an act of desperation, he hired a tribe of cannibals.  At their orientation he made it very clear that he would not tolerate any acts of cannibalism in the plant.\r\n\r\nThree months went by without incident, when all of a sudden a secretary disappeared without a trace.\r\n\r\nThe manager rounded up all of the cannibals.\r\n\"If I find out that one of you ate the secretary,\" he said, \"I'm going to fire all of you!\" and with that, stormed out of the room.\r\n\r\nAfter he left the room, one of the cannibals stood up and said, \"This is a disgrace! For months we've been eating managers and no one has even noticed!  Which one of you fools ate a secretary?!\"",
    "category": "At Work",
    "id": 35,
    "title": "Cannibals"
  },
  {
    "body": "Jim is in a hot-air balloon, completely lost.  He sees a man in a field below and flies down to him.\r\n\r\n\"Excuse me sir, but can you tell me where I am?\"\r\n\r\nThe man in the field replied \"You're in a balloon.\"\r\n\r\nJim said \"You're an engineer, aren't you?\"\r\n\r\n\"Why yes, I am.  How did you know?\"\r\n\r\n\"Because you gave me a perfectly logical, yet completely useless answer.\"\r\n\r\nJim continued flying, when he saw another man in a field.  \"Excuse me, sir, but can you tell me where I am?\" he asked.\r\n\r\n\"Well, you're about two miles north of Ogdenville.  If you go to the west side of town you'll find an airstrip that you can safely land on.\"\r\n\r\nJim replied \"Thank you very much, sir.  That was extremely helpful.  Say, I'll bet you're a manager, aren't you?\"\r\n\r\n\"Why yes, I am, how did you know?\"\r\n\r\n\"Because your pants are on backward\".",
    "category": "At Work",
    "id": 36,
    "title": "Balloon Ride"
  },
  {
    "body": "An Engineering Major says \"How does it work?\"\r\n\r\nA Science Major says \"Why does it work?\"\r\n\r\nAn Accounting Major says \"How much will it cost?\"\r\n\r\nA Liberal Arts Major says \"Do you want fries with that?\"",
    "category": "College",
    "id": 37,
    "title": "How Does It Work?"
  },
  {
    "body": "How many psychologists does it take to change a light bulb?\r\n\r\nOnly one, but the bulb has got to WANT to change.",
    "category": "Lightbulb",
    "id": 38,
    "title": "Psychologist Handyman"
  },
  {
    "body": "A man was sitting next to the Pope on a cross-country flight.  The Pope was doing a crossword puzzle.  He turned to the man and asked \"Do you know a four-letter word for 'woman' that ends in U-N-T?\"\r\n\r\nThe man thought for a minute and said \"Aunt.\"\r\n\r\n\"Oh yes, of course,\" the Pope replied.  \"Do you have an eraser?\"",
    "category": "Men / Women",
    "id": 39,
    "title": "Pope's Crossword Puzzle"
  },
  {
    "body": "A brunette was walking down the middle of the street, saying \"34...34...34\" over and over again.  A blonde stopped her and asked why she was doing that.\r\n\r\n\"Oh, it's great fun,\" replied the brunette. \"You should try it\".\r\n\r\nSo the blonde walked down the street repeating \"34...34...34...\" when all of a sudden a car sped by and ran her over.\r\n\r\nThe brunette then started walking down the road again, saying \"35...35...35...\"",
    "category": "Blond",
    "id": 40,
    "title": "34...34...34..."
  },
  {
    "body": "How can you tell if a blonde woman has been dating?\r\n\r\nBy the belt buckle imprint on her forehead.",
    "category": "Blond",
    "id": 41,
    "title": "Dating Blonde"
  },
  {
    "body": "What does a blonde say when she loses her virginity?\r\n\r\n\"So are you guys all on the same team?\"",
    "category": "Blond",
    "id": 42,
    "title": "Blonde Deflowering"
  },
  {
    "body": "How many lawyers does it take to shingle the roof of a house?\r\n\r\nIt depends on how thin you slice 'em.",
    "category": "Lawyer",
    "id": 43,
    "title": "Shingles"
  },
  {
    "body": "Did you hear the one about the Polish wolf?\r\n\r\nHe chewed off three legs and was still caught in the trap.",
    "category": "Animal",
    "id": 44,
    "title": "Polish Wolf"
  },
  {
    "body": "A polar bear walked into a bar and said\r\n\"Can I please have a gin and............................................tonic?\"\r\nThe bartender replied \"Sure, but why the large pause?\"\r\n\"I don't know, I've always had them!\"",
    "category": "Puns",
    "id": 45,
    "title": "Polar Bear"
  },
  {
    "body": "A termite walks into a bar and asks, \"Is the bartender here?\"",
    "category": "Animal",
    "id": 46,
    "title": "Termit"
  },
  {
    "body": "Did you know diarhea is part of your inheritence?\r\n\r\nYa, it flows in our genes.",
    "category": "Puns",
    "id": 50,
    "title": "Diarhea"
  },
  {
    "body": "It's wise to remember how easily this wonderful technology can be misused, sometimes unintentionally, with serious consequences.\r\n\r\nConsider the case of the Illinois man who left the snow-filled streets of Chicago for a vacation in Florida. His wife was on a business trip and was planning to meet him there the next day. When he reached his hotel, he decided to send his wife a quick e-mail. Unable to find the scrap of paper on which he had written her e-mail address, he did his best to type it in from memory.\r\n\r\nUnfortunately, he missed one letter, and his note was directed instead to an elderly preacher's wife, whose husband had passed away only the day before. When the grieving widow checked her e-mail, she took one look at the monitor, let out a piercing\r\nscream, and fell to the floor in a dead faint.\r\n\r\nAt the sound, her family rushed into the room and saw this note on the screen:\r\n\r\nDearest Wife,\r\n\r\nJust got checked in. Everything prepared for your arrival tomorrow.\r\n\r\nPS. Sure is hot down here.",
    "category": "Other / Misc",
    "id": 51,
    "title": "E-mails"
  },
  {
    "body": "There's this guy he goes to see the doctor and says, \"Doctor, Doctor, I have a terrible problem. I have a strawberry stuck up my bottom.\"\r\nThe doctor says, \"It's ok, I'll give you some cream to put on it.\"",
    "category": "Medical",
    "id": 52,
    "title": "Strawberry Issues"
  },
  {
    "body": "The new priest is nervous about hearing confessions, so he asks an older priest to sit in on his sessions.\r\n\r\nThe new priest hears a couple confessions, then the old priest asks him to step out of the confessional for a few suggestions.\r\n\r\nThe old priest suggests, \"Cross you arms over your chest, and rub your chin with one hand.\" The new priest tries this. The old priest suggests, \"Try saying things like, 'I see,' 'yes,' 'go on,' 'I understand,' and 'how did you feel about that?'\"\r\n\r\nThe new priest says those things, trying them out.\r\nThe old priest says, \"Now, don't you think that's a little better than slapping your knee and saying 'No shit! What happened next?'\"",
    "category": "Religious",
    "id": 53,
    "title": "Sound Advice"
  },
  {
    "body": "Before you judge someone, you should walk a mile in their shoes. \r\nThat way, when you judge them, you're a mile away and you have their shoes.",
    "category": "One Liners",
    "id": 54,
    "title": "Judgement"
  }
 ]